[
  {
      "index":0,
      "type":"Computer Society",
      "title":"Linux Workshop",
      "date":"18 Jan 2020",
      "location":"Govt. Model Engineering College",
      "img_src":"linux.jpg",
      "description":"Linux is a popular Operating System, often used as an alternative to the widely used Windows. Understanding and working with LINUX stands as a criterion for many companies while seeking jobs. LINUX is also useful for programming as it's widely considered more professional.\nAnalysing the importance of familiarising with LINUX as an essential part of an engineer's skillset, IEEE MEC SB's CS Society is conducting a workshop on Linux and Debian packaging. Important topics such as Shell programming, Linux commands and file modification would be covered in the workshop. The workshop will include an introductory session, along with hands-on, interactive sessions. Different applications which run on Linux alternative to Windows would also be discussed.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":1,
      "type":"General",
      "title":"M.A.G.I.C",
      "date":"8-9 Feb 2020",
      "location":"Govt. Model Engineering College",
      "img_src":"magic.jpg",
      "description":"MEC Annual Gathering of IEEE Community (M.A.G.I.C.), the flagship event of IEEE MEC SB, is a 2 day event aimed at sparking the curiosity of students and getting them involved and interested in technology. From three different peer to peer workshops with mentors and volunteers helping participants along every step of the way to an exciting and unique overnight mini-hackathon, the event certainly guarantees a magical experience for all who attend.\nThe other highlights of the event include an array of thought-provoking and creative sessions on entrepreneurship, and out of the box thinking along with plenty of socialising and networking opportunities for the student participants.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":2,
      "type":"Signal Processing Society",
      "title":"Scientific Computing Tools Workshop",
      "date":"22-23 Feb 2020",
      "location":"Govt. Model Engineering College",
      "img_src":"matlab.jpg",
      "description":"Scientific Computing Tools Workshop is a 2 day event conducted by the Signal Processing Society (SPS) of IEEE MEC SB.\nThe highly engaging and interactive workshop polishes the basics of computing tools ensuring that every student, irrespective of year, finds it easy to follow. The workshop highlights all the useful domains to provide a comprehensive knowledge and understanding for the maximum benefit of the participant.\nFurther, study material comprising both the theoretical and practical aspects of the topic will be given to the students so that they may delve deeper and learn to apply their knowledge.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":3,
      "type":"Wie Affinity Group",
      "title":"NOW WHAT",
      "date":"16 March 2020",
      "location":"Govt. Model Engineering College",
      "img_src":"4.jpg",
      "description":"In the 21st century, discrimination on the basis of gender no longer exists before law, yet there is still a long way to go before men and women are truly at par with each other in society.\n' NOW WHAT ' is an article writing competition conducted by IEEE MEC SB which asks us what happens next, in the field of gender equality and diversity, at a time when technology plays a critical role in daily lives.</br>The article writing competition places a special emphasis on the implementation of modern technology to bring about a change in various arenas of technology, education, politics and social interactions for women.\nParticipants get a great opportunity to research upon the current situation of gender equality in terms of opportunities and provide innovative ideas using modern technology and resources to help women in their pursuits.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":4,
      "type":"General",
      "title":"Home Hack",
      "date":"23-27 March 2020",
      "location":"Online",
      "img_src":"5.jpg",
      "description":"An online Hackathon, held in collaboration with IEEE CUSAT SB, HomeHack aims to improve productivity and innovations during the quarantine period. Spread over a span of 5 days, the event encourages students to solve problems in 5 major fields.\n⚫ Education\n⚫ Medicine\n⚫ Agriculture\n⚫ Cyber Security\n⚫ IoT\nThe Hackathon is also spiced up with daily challenges such as witty riddles, calligraphy and coding contests. HomeHack offers several exciting prizes in different categories and individual prizes for the daily challenges too.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":5,
      "type":"Industrial Applications Society",
      "title":"Surge",
      "date":"3 April 2020",
      "location":"Online",
      "img_src":"6.jpg",
      "description":"An idea pitching competition, SURGE invites ideas on Sustainable Engineering Projects for Humanity.\nConducted by the Industrial Applications Society (IAS) and the Power and Energy Society (PES) of IEEE MEC SB, SURGE is an online event that requires participants to explore their minds and produce innovative project ideas. The event throws light on sustainability and the constant pursuit for more sustainable products. Ensuring that every student, irrespective of branch or year is encouraged to contribute, the contest broadens the array of ideas received.\nThe search is for the team or individual that brings forth the most impactful and technologically feasible sustainable engineering project idea.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":6,
      "type":"General",
      "title":"IntraMUN (ICS)",
      "date":"7-8 March 2020",
      "location":"Govt. Model Engineering College",
      "img_src":"intramun.jpg",
      "description":"IntraMUN, the Intra-Collegiate Model United Nations at Model Engineering College, presents a chance for participants to showcase and improve their diplomatic and debating skills. The two days of the event brings forth five different committees:\n⚫ United Nations Human Rights Committee (UNHRC)\n⚫ All India Political Party Meet (AIPPM)\n⚫ Continuous Crisis Committee(CCC)\n⚫ International Corporate Summit (ICS).\n⚫ International Press(IP)\nIEEE MEC SB has joined hands with MECMUNSoc to organise the International Corporate Summit (ICS), a unique platform for delegates to represent Corporate or Business entities that come together for discussion and debate on the technical topic of Data Privacy and Security in the AI era.\nFrom being given the chance to represent the CTOs of the biggest corporations to having don the mantle of IT ministers of powerful nations, the event promises to be both entertaining as well as highly informative for every participating delegate.",
      "reg": "disabled",
      "link":" "
  },
  {
      "index":7,
      "type":"Industrial Applications Society",
      "title":"Surge",
      "date":"3 April 2020",
      "location":"Online",
      "img_src":"6.jpg",
      "description":"An idea pitching competition, SURGE invites ideas on Sustainable Engineering Projects for Humanity.\nConducted by the Industrial Applications Society (IAS) and the Power and Energy Society (PES) of IEEE MEC SB, SURGE is an online event that requires participants to explore their minds and produce innovative project ideas. The event throws light on sustainability and the constant pursuit for more sustainable products. Ensuring that every student, irrespective of branch or year is encouraged to contribute, the contest broadens the array of ideas received.\nThe search is for the team or individual that brings forth the most impactful and technologically feasible sustainable engineering project idea.",
      "reg": "disabled",
      "link":" "
  },
  {
    "index":8,
    "type":"Industrial Applications Society",
    "title":"Surge",
    "date":"3 April 2020",
    "location":"Online",
    "img_src":"6.jpg",
    "description":"An idea pitching competition, SURGE invites ideas on Sustainable Engineering Projects for Humanity.\nConducted by the Industrial Applications Society (IAS) and the Power and Energy Society (PES) of IEEE MEC SB, SURGE is an online event that requires participants to explore their minds and produce innovative project ideas. The event throws light on sustainability and the constant pursuit for more sustainable products. Ensuring that every student, irrespective of branch or year is encouraged to contribute, the contest broadens the array of ideas received.\nThe search is for the team or individual that brings forth the most impactful and technologically feasible sustainable engineering project idea.",
    "reg": "disabled",
    "link":" "
  }
]
